app/controllers/api/v1/characters_controller.rb

SELECT "characters".* FROM "characters"
---
  def houses
    character = Character.all.map {|character| character.url}